Билет_сервер/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Билет_сервер/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВалютная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

Билет_сервер/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Билет_сервер/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Билет_сервер/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Договор</name>
      <description>Договор</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Билет_сервер/src/Documents/ПриходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Записывать=Истина;
	Движения.Управленческий.БлокироватьДляИзменения=Истина;
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записать();
	
	Блокировка=Новый БлокировкаДанных;
	ЭлементБлокировки=Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.Покупатели);
	ЭлементБлокировки.УстановитьЗначение(ПланыВидовХарактеристик.ВидыСубконто.Контрагент, Контрагент);
	Блокировка.Заблокировать();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	УправленческийОстатки.Субконто2 КАК Договор,
	             |	УправленческийОстатки.СуммаОстаток КАК СуммаОстаток,
	             |	УправленческийОстатки.СуммаВалютнаяОстаток,
	             |	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс,
	             |	УправленческийОстатки.Субконто2.Валюта КАК Валюта
	             |ИЗ
	             |	РегистрБухгалтерии.Управленческий.Остатки(&МоментИтогов, Счет = &СчетПокупатели, &Субконто, Субконто1 = &КОнтрагент) КАК УправленческийОстатки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментИтогов, ) КАК КурсыВалютСрезПоследних
	             |		ПО УправленческийОстатки.Субконто2.Валюта = КурсыВалютСрезПоследних.Валюта
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СуммаОстаток УБЫВ";
				 
	Субконто=Новый Массив(2);
	Субконто[0]=ПланыВидовХарактеристик.ВидыСубконто.Контрагент;
	Субконто[1]=ПланыВидовХарактеристик.ВидыСубконто.Договор;
	
	Запрос.УстановитьПараметр("МоментИтогов", МоментВремени());
	Запрос.УстановитьПараметр("СчетПокупатели", ПланыСчетов.Управленческий.Покупатели);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка=Запрос.Выполнить().Выбрать();
	ОсталосьСписать=Сумма;
	Пока Выборка.Следующий() и ОсталосьСписать<>0 Цикл
		Списываем = Мин (ОсталосьСписать, Выборка.СуммаВалютнаяОстаток * Выборка.Курс);
		Проводка=Движения.Управленческий.Добавить();
		Проводка.Период=Дата;
		Проводка.СчетДт=ПланыСчетов.Управленческий.Касса;
		Проводка.СчетКт=ПланыСчетов.Управленческий.Покупатели;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент]=Контрагент;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор]=Выборка.Договор;
		Проводка.СуммаВалютнаяКт=Списываем/Выборка.Курс;
		Проводка.Сумма=Списываем;
		ОсталосьСписать=ОсталосьСписать-Списываем;
	КонецЦикла;
	
КонецПроцедуры
